Module/admin/controllers/CategoryController.php

SELECT `goods_type_id` FROM `category` WHERE category_id='7'
SELECT `goods_attr_id`, `attr_name` FROM `type_attr` WHERE goods_type_id='1'
SELECT `filter_attr` FROM `category` WHERE goods_type_id='1'
SELECT * FROM `category` WHERE `category_id`='7'
UPDATE `category` SET `filter_attr`='1,2,3,6,7,10' WHERE `category_id`=7
---
    public function  actionShuaixuan()
    {
        $model=new Category();

        $category_id=$_GET['category_id']?$_GET['category_id']:null;
        $goods_type_id=Category::find()->select('goods_type_id')->where('category_id=:categoryid',[':categoryid'=>$category_id])->asArray()->one();
        $data=TypeAttr::find()->select(['goods_attr_id','attr_name'])->where('goods_type_id=:id',[':id'=>$goods_type_id['goods_type_id']])->asArray()->all();
        $filter_attr=Category::find()->select('filter_attr')->where('goods_type_id=:id',[':id'=>$goods_type_id['goods_type_id']])->asArray()->one();
        $filterattr=explode(",",$filter_attr['filter_attr']);


        /**
         * 下边两句是从数据库把帅选条件的id,name取出来
         */
       // $xuanzhonglist=TypeAttr::find()->select(['attr_name','goods_attr_id'])->where(['in','goods_attr_id',$filterattr])->asArray()->all();
       // $xuanzhong=array_column($xuanzhonglist,'attr_name','goods_attr_id');


        //array_column  将二维数组转换成一维数组
        $list=array_column($data,'attr_name','goods_attr_id');
        $request=Yii::$app->request;
        $data=$request->post();
        if ($request->isPost&&$model->load($data)){
            $category_id=$data['Category']['category_id'];
            $category = Category::findOne($category_id);
            $category->filter_attr=implode(',',$data['Category']['filter_attr']);
            $category->update();