Module/admin/controllers/GoodsController.php

SELECT * FROM `goods`
---
    public function  actionList()
    {
        $this->layout='main1';
        $data=Goods::find()->all();

SELECT * FROM `category`
SELECT EXISTS(SELECT * FROM `brand` WHERE (`brand`.`brand_id`='1'))
SELECT * FROM `brand`
SELECT `goods_type_id` FROM `category` WHERE category_id=7
SELECT `goods_attr_id`, `attr_name`, `attr_may_value` FROM `type_attr` WHERE goods_type_id=1 and attr_type=1
SELECT EXISTS(SELECT * FROM `category` WHERE (`category`.`category_id`='7'))
---
    public function  actionAddgoods()
    {
        $this->enableCsrfValidation=false;
        $this->layout='main1';
        $model=new Goods();
        $product=new Product();
        $category=Category::find()->all();
        $brand=Brand::find()->all();
        //只查询手机的参数   category中手机的id是7
        $goods_type_id=Category::find()->select('goods_type_id')->where('category_id=:id',[':id'=>7])->one();
        $goods_type=GoodsType::find()->all();
        $goods_attr_list=new GoodsAttrList();
        //只取出type=0的，，就是参数
        $canshu=TypeAttr::find()->select(['goods_attr_id','attr_name','attr_may_value'])->where('goods_type_id=:id and attr_type=:type',[':id'=>$goods_type_id['goods_type_id'],':type'=>0])->all();
        $guige=TypeAttr::find()->select(['goods_attr_id','attr_name','attr_may_value'])->where('goods_type_id=:id and attr_type=:type',[':id'=>$goods_type_id['goods_type_id'],':type'=>1])->all();

INSERT INTO `goods` (`goods_name`, `admin_user_id`, `goods_type_id`, `promote_word`, `category_id`, `brand_id`, `goods_sn`, `sku`, `goods_price`) VALUES ('è‹¹æžœ8', 1, 1, '123', 7, 3, '12', 123, '123')
---
            $model->goods_sn=$_POST['Goods']['goods_sn'];
            $model->sku=$_POST['Goods']['sku'];
            $model->goods_price=$_POST['Goods']['goods_price'];
           $model->save(false);

INSERT INTO `goods_attr_list` (`attr_value`, `goods_id`, `goods_attr_id`) VALUES ('3,1,3,4,4', '7', 1)
---
               $goods_attr_list->attr_value=$v;
               $goods_attr_list->goods_id=$goods_id;
               $goods_attr_list->goods_attr_id=1;
               $goods_attr_list->save(false);

INSERT INTO `product` (`attr_list`, `sku`, `price`, `goods_sn`, `goods_id`) VALUES ('3,1,2', 123, '123', '123', '7')
---
            $product->price=$_POST['Product']['price'];
            $product->goods_sn=$_POST['Product']['goods_sn'];
            $product->goods_id=$goods_id;
           $product->save(false);

SELECT * FROM `product`
---
    public function  actionHuopin($goods_id)
    {
         // echo $goods_id;
        if (Yii::$app->request->isPost){
          $sql="SELECT a.*,b.attr_name from goods_attr_list a  LEFT  JOIN type_attr b  on a.goods_attr_id=b.goods_attr_id  WHERE a.goods_id=7 and  b.attr_type=1";
          $data=Yii::$app->db->createCommand($sql)->queryAll();

          //此处是把二维数组转换成三维数组
          $_data=[];

          foreach ($data   as $k=>$v){
              $_data[$v['attr_name']][]=$v;
          }
          return $this->render('huopin',['data'=>$_data]);
        }

        else{
                $data=Product::find()->all();

INSERT INTO `product` (`goods_id`, `attr_list`, `price`) VALUES ('7', '5,6,7', '123')
---
    public function  actionGoodsnumber()
    {


       $goods_attr_id=$_POST['goods_attr_id'];
        $goods_number=$_POST['goods_number'];
        $rate=count($goods_attr_id)/count($goods_number);
        $_i=0;
        foreach ($goods_number as $k=>$v) {
            $attr_list=[];
            for ($i=0;$i<$rate;$i++){
                $attr_list[]=$goods_attr_id[$_i];
                $_i++;
            }
            sort($attr_list,SORT_NUMERIC);
            $attr_list=(string)implode(',',$attr_list);
            $model=new Product();

            $model->goods_id=7;
            $model->attr_list=$attr_list;
            $model->price=$goods_number;
            $model->save(false);