Module/admin/controllers/TypeController.php

SELECT * FROM `goods_type`
---
    public function   actionIndex()
    {
        $data=GoodsType::find()->all();

SELECT * FROM `type_attr` WHERE goods_type_id='2'
---
    public function  actionAttrlist()
    {
        $goods_type_id=$_GET['goods_type_id']?htmlentities($_GET['goods_type_id']):0;
        $data=TypeAttr::find()->where('goods_type_id=:goodstypeid',['goodstypeid'=>$goods_type_id])->all();