models/Admin.php

    public function  validatePass()
    {
        if (!$this->hasErrors())
        {
            $data=self::find()->where('username=:user and password=:pass',[":user"=>$this->username,":pass"=>md5($this->password)])->one();
---
SELECT * FROM `admin` WHERE username='hades' and password='e10adc3949ba59abbe56e057f20f883e'