models/Category.php

    public function  wuxian()
    {
        $data=self::find()->asArray()->all();
---
SELECT * FROM `category`