models/TypeAttr.php

    public function  baocun($data){
        if ($this->load($data)&&$this->validate()){
            return($this->save(false));
---
INSERT INTO `type_attr` (`attr_name`, `attr_type`, `attr_may_value`, `sort`, `goods_type_id`) VALUES ('芯片类型', 0, 'GTX 1050\r\nGTX 1080\r\n', 2, 2)